title = """
------- ガーシーメモリアル ------

        名前を入力してね！
"""
heroine_desc = """
【北 ひなた】

血液型：A型

身長：158cm

人となり：明るい性格でいつも笑顔、人といるのが好き。いろいろな部活から助っ人を頼まれたり、何かと活動的。

-------------------------------

【南 なぎさ】

血液型：O型

身長：162cm

人となり：優しい性格。

-------------------------------


【西 ももか】

血液型：B型

身長：155cm

人となり：おとなしい性格で一人でいることが多い、ゲームが好き。
"""
scenario1 = """
蝉のなく暑い夏日。俺はこの学校に転校してきた。
友達を作ろうと頑張ってみたけどうまくいかない。俺は一人ぼっちだ……
そんなとき出会ったのが隣の席の女子、南ももかだった。
彼女はいつも一人でいて大人しく目立たない存在。でも彼女の笑顔を見た瞬間に好きになってしまった。
そこで、お近づきになるためにまずは会話をしてみることにした。
「おはよう！南さん！！」
"""
select1 = """
1:「南さんって好きな人とかいないの？」
2:「今日はいい天気だね！」
3:「何色のパンツはいてるの？」
"""
game_over = """
気まずい空気が流れた。
その後、もう一生話すことはなかった。

---------- Bad End ---------"""
scenario2 = """
「南さんって好きな人とかいないの？」
「えっ？いないよ……」
「じゃあ、付き合ってくれる人いたらどうする？」
「うーん……」
「いや、あのさ、変なこと聞いてごめんね」
「うん……」
彼女は少しだけ考えて答えた。
「私はその人のことをよく知ってから決めたいかなぁ」
「そっかぁ」
それから俺たちは少しずつ仲良くなっていった。そんなある日のこと、彼女に呼び出されてこう言われた
「ねぇ、私、君ともっと仲良くなりたいんだ」
「ほんと！？嬉しい！」
「それでさ、君のこともっと知りたくて……。だからさ、私の家に来てくれないかな？」
「えっ！いいの！？」
「うん、お母さんには言ってあるし大丈夫だよ」
「やった！」
そして放課後、彼女の家にお邪魔することになった。
彼女についていくと小さなアパートについた。
「ここが私の家だよ」
「へぇ〜綺麗にしてるね〜」
「ありがとう、上がって」
「おじゃましまーす」
部屋に入ると
「こっち来て」
「何これ？」
そこにはゲーム機があった。それも複数台。
「一緒にゲームしようよ」
「うん、わかった」
二人でゲームをして遊んでいるうちに時間は過ぎていった。気づけばもう夜になっていた。
「今日は楽しかったよ。また明日学校で会おうね」
「そうだね。それじゃあバイバーイ」
次の日の朝、学校に着くとすぐに彼女が話しかけてきた。
「昨日は楽しかったね」
「そうだね。次は何のゲームをやる予定なの？」
「えっとね、次はこのゲームやってみない？」
そうして俺らは昼休み中ずっとゲームをしていた。気づけば外では雨が降っていた。
「すごい雨だね。傘持ってきてなかったから帰れないかも……」
「そうなの？もしよかったら泊まってく？」
「えっ！いいの！？」

「うん、もちろんいいよ」
「やった！」
こうして俺は彼女の家に泊まりに行くことになった。
彼女とは夕飯を食べながらいろんな話をした。ゲームの話はもちろんだけどお互いの家族構成や趣味など色々な話をした。
「そろそろ寝ようか」
「うん、お風呂入るね」
「あっ、先に布団敷いておくよ」
「ありがと」
お風呂上がりにドライヤーを貸してもらい髪を乾かすことにした。しかし……
（あれ？スイッチどこにあるんだろう？）
すると後ろから声をかけられた。
「どうしたの？」

「ああ、ちょっと髪乾かしたかったんだけど場所がわからなくて」
「そっか、じゃあ私がやってあげるよ」
「えっ、いいの？」
「うん、任せて」
彼女に髪を乾かしてもらうなんて夢みたいだ。
「はい、できたよ」

「ありがとう」
それからは二人でテレビを見て過ごしたりトランプをしたりしながら時間を過ごした。
「ねぇ、今日は楽しかった？」
「うん、すごく楽しかったよ」
「良かったぁ。私もすっごく楽しかった」
「これからもよろしくね」
「こちらこそ」

「あのさ、一つお願いがあるんだけど」
「何？」
「あのさ、キスしてもいいかな？」
「えっ！？」
「ダメ……かな？」
「うーん、まだ早いんじゃないかな」
「そう……だよね」
「でもさ、君とならそういうこともしたいなって思ってるんだ」
「本当！？」
「うん」
「俺も南さんとなら……その、してみたいなって」
「じゃあ、目瞑って」
「う、うん」
目を閉じて少し待っていると唇に柔らかい感触
「んっ……」
「ぷはっ」
「どうだった？」
「気持ちよかった……」
「私も同じだよ」
それからは毎日のように一緒に遊んで、時には勉強を教えあったりした。そんな日々を過ごしていくうちに俺たちは恋人同士になった。
それからしばらくして……俺は彼女の両親と一緒に暮らすことになった。最初は緊張していたけど次第に慣れてきて、今ではすっかり仲良くなった。彼女はとても優しい人で料理上手でいつも美味しいご飯を作ってくれた。
ある日、仕事の関係で出張に行くことになってしまった。そして、その日の夜のこと。
「君と離れるのは寂しいよ……」
「俺も寂しい……」
「でも仕方ないことだし、私我慢するよ」
「ごめんね」
「ううん、気にしないで。それよりさ、帰ってきたらいっぱい甘えていい？」
「もちろん」
「約束だよ？」
「うん」
「それじゃあ、行ってきます」
「いってらっしゃい」
そして俺は仕事へと向かった。
それから1ヶ月後、ようやく帰ってこれた。家に帰ると彼女が出迎えてくれた。
「おかえりなさい」
「ただいま」
それからは彼女と共に楽しい生活が始まった。今まで以上に幸せな時間を過ごせた。
"""